package chapter3;

public class IntDetail
{
    /*
    整数类型
    整型的使用细节 IntDetail.java
    +--------+----------------+------------------+------------------+---------------------+
    | 类型   | 占用字节       | 范围（数学表示） | 范围（数值表示） | 二进制解释          |
    +--------+----------------+------------------+------------------+---------------------+
    | byte   | 1              | -2^7 ~ 2^7-1     | -128 ~ 127       | 最高位为符号位      |
    | short  | 2              | -(2^15) ~ 2^15-1 | -32768 ~ 32767   | 最高位为符号位      |
    | int    | 4              | -2^31 ~ 2^31-1   | -2147483648 ~ 2147483647 | 最高位为符号位  |
    | long   | 8              | -2^63 ~ 2^63-1   | -9223372036854775808 ~ 9223372036854775807 | 最高位为符号位 |
    +--------+----------------+------------------+------------------+---------------------+
    1. Java各整数类型有固定的范围和字段长度，不受具体OS[操作系统]的影响，以保证Java程序的可移植性。
    2. Java的整型常量（具体值）默认为int型，声明long型常量须加‘|’或‘L’。
    3. java程序中变量常声明为int型，除非不足以表示大数，才使用long
    4. bit:计算机中的最小存储单位。byte:计算机中基本存储单元,1byte=8bit。[二进制再详细说，简单举例一个 byte 3 和 short 3 ]
    思考题: long类型，有几个bit [8 * 8 = 64 bit] long n =3; //内存中
    */
    public static void main(String[] args)
    {
        //Java的整型常量（具体值）默认为 int 型，声明long型常量须后加‘L’或‘l’
        int n1 = 1;//4个字节
        //int n2 = 1L;//对不对？不对
        long n3 = 1L;//对

    }

}
